qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32F3XX/stm32f30x_spi.c
/**
  ******************************************************************************
  * @file    stm32f30x_spi.c
  * @author  MCD Application Team
  * @version V1.1.0
  * @date    27-February-2014
  * @brief   This file provides firmware functions to manage the following 
  *          functionalities of the Serial peripheral interface (SPI):
  *           + Initialization and Configuration
  *           + Data transfers functions
  *           + Hardware CRC Calculation
  *           + DMA transfers management
  *           + Interrupts and flags management
  *
  *  @verbatim
  
  
 ===============================================================================
                      ##### How to use this driver #####
 ===============================================================================
    [..]
        (#) Enable peripheral clock using RCC_APBPeriphClockCmd(RCC_APB2Periph_SPI1, ENABLE)
            function for SPI1 or using RCC_APBPeriphClockCmd(RCC_APB1Periph_SPI2, ENABLE)
            function for SPI2.
        (#) Enable SCK, MOSI, MISO and NSS GPIO clocks using RCC_AHBPeriphClockCmd()
            function. 
        (#) Peripherals alternate function: 
            (++) Connect the pin to the desired peripherals' Alternate 
                 Function (AF) using GPIO_PinAFConfig() function.
            (++) Configure the desired pin in alternate function by:
                 GPIO_InitStruct->GPIO_Mode = GPIO_Mode_AF.
            (++) Select the type, pull-up/pull-down and output speed via 
                 GPIO_PuPd, GPIO_OType and GPIO_Speed members.
            (++) Call GPIO_Init() function.
        (#) Program the Polarity, Phase, First Data, Baud Rate Prescaler, Slave 
            Management, Peripheral Mode and CRC Polynomial values using the SPI_Init()
            function in SPI mode. In I2S mode, program the Mode, Standard, Data Format,
            MCLK Output, Audio frequency and Polarity using I2S_Init() function.
        (#) Configure the FIFO threshold using SPI_RxFIFOThresholdConfig() to select 
            at which threshold the RXNE event is generated.     
        (#) Enable the NVIC and the corresponding interrupt using the function 
            SPI_I2S_ITConfig() if you need to use interrupt mode. 
        (#) When using the DMA mode 
            (++) Configure the DMA using DMA_Init() function.
            (++) Active the needed channel Request using SPI_I2S_DMACmd() function.
        (#) Enable the SPI using the SPI_Cmd() function or enable the I2S using
            I2S_Cmd().
        (#) Enable the DMA using the DMA_Cmd() function when using DMA mode. 
        (#) Optionally you can enable/configure the following parameters without
            re-initialization (i.e there is no need to call again SPI_Init() function):
            (++) When bidirectional mode (SPI_Direction_1Line_Rx or SPI_Direction_1Line_Tx)
                 is programmed as Data direction parameter using the SPI_Init() function
                 it can be possible to switch between SPI_Direction_Tx or SPI_Direction_Rx
                 using the SPI_BiDirectionalLineConfig() function.
            (++) When SPI_NSS_Soft is selected as Slave Select Management parameter 
                 using the SPI_Init() function it can be possible to manage the 
                 NSS internal signal using the SPI_NSSInternalSoftwareConfig() function.
            (++) Reconfigure the data size using the SPI_DataSizeConfig() function.  
            (++) Enable or disable the SS output using the SPI_SSOutputCmd() function.
        (#) To use the CRC Hardware calculation feature refer to the Peripheral 
            CRC hardware Calculation subsection.
    [..] It is possible to use SPI in I2S full duplex mode, in this case, each SPI 
         peripheral is able to manage sending and receiving data simultaneously
         using two data lines. Each SPI peripheral has an extended block called I2Sxext
         (ie. I2S2ext for SPI2 and I2S3ext for SPI3).
         The extension block is not a full SPI IP, it is used only as I2S slave to
         implement full duplex mode. The extension block uses the same clock sources
         as its master.          
         To configure I2S full duplex you have to:
        (#) Configure SPIx in I2S mode (I2S_Init() function) as described above. 
        (#) Call the I2S_FullDuplexConfig() function using the same strucutre passed to  
            I2S_Init() function.
        (#) Call I2S_Cmd() for SPIx then for its extended block.
        (#) Configure interrupts or DMA requests and to get/clear flag status, 
            use I2Sxext instance for the extension block.
        [..] Functions that can be called with I2Sxext instances are:
             I2S_Cmd(), I2S_FullDuplexConfig(), SPI_I2S_ReceiveData16(), SPI_I2S_SendData16(), 
             SPI_I2S_DMACmd(), SPI_I2S_ITConfig(), SPI_I2S_GetFlagStatus(), SPI_I2S_ClearFlag(),
             SPI_I2S_GetITStatus() and SPI_I2S_ClearITPendingBit().
        [..] Example: To use SPI3 in Full duplex mode (SPI3 is Master Tx, I2S3ext is Slave Rx):
        [..] RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI3, ENABLE);   
             I2S_StructInit(&I2SInitStruct);
             I2SInitStruct.Mode = I2S_Mode_MasterTx;     
             I2S_Init(SPI3, &I2SInitStruct);
             I2S_FullDuplexConfig(SPI3ext, &I2SInitStruct)
             I2S_Cmd(SPI3, ENABLE);
             I2S_Cmd(SPI3ext, ENABLE);
             ...
             while (SPI_I2S_GetFlagStatus(SPI2, SPI_FLAG_TXE) == RESET)
             {}
             SPI_I2S_SendData16(SPI3, txdata[i]);
             ...  
             while (SPI_I2S_GetFlagStatus(I2S3ext, SPI_FLAG_RXNE) == RESET)
             {}
             rxdata[i] = SPI_I2S_ReceiveData16(I2S3ext);
             ...          
    [..]
    (@) In SPI mode: To use the SPI TI mode, call the function SPI_TIModeCmd() 
        just after calling the function SPI_Init().  
              
    @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2014 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f30x_spi.h"
#include "stm32f30x_rcc.h"

/** @addtogroup STM32F30x_StdPeriph_Driver
  * @{
  */

